#+title: 苹果, 梨, 橘子以及翻车
#+date: 2023-07-13
#+layout: post
#+options: _:nil ^:nil
#+math: true
#+categories: lisp
** 艺术就是爆炸...
问题的思路就是要找到一个最大两两连接图.
一个比较朴素的解决思路是这样的:

+ 用一个 =to-search-nodes= 作为待搜索节点的列表,
  用一个 =searched-nodes= 作为已经找过的节点列表
+ 假如 =to-search-nodes= 不为空, 则取其中的一个节点 =node=
  + 假如该节点和已经找过的节点都相连接 =test-connection=,
    则将该节点添加到 =searched-nodes=, 然后以在 =to-search-nodes= 中,
    =node= 后的节点作为新的 =to-search-nodes= 继续搜索.
  + 假如不相连, 那么直接就搜索下一个 =node=
+ 假如 =to-search-nodes= 为空, 则更新最大长度的信息
+ 在搜索完毕后, 返回最大长度信息

当然, 为了实现上面的算法, 将图转换为邻接矩阵的形式可能会比较好:

#+name: arc-to-matrix
#+begin_src lisp
  (defun arc-to-matrix (size arcs)
    "将边组 ARCS 变换为邻接矩阵形式. 

  其中 ARCS 的形式为 ((点1 点2) ...), 是无向图.
  得到的 MATRIX 的形式为 ((a11 a12 ...) (a21 a22 ...) ...)."
    (let ((matrix (loop for i from 0 below size
                        collect (make-list size :initial-element 0))))
      (loop for arc in arcs do
            (let ((p1 (first  arc))
                  (p2 (second arc)))
              (setf (at matrix p1 p2) 1
                    (at matrix p2 p1) 1)))
      matrix))
#+end_src

然后在邻接矩阵的基础上去查找一个最大两两连接图:

#+begin_html
<details><summary> 其中的一些帮助函数 </summary>
#+end_html

+ 最大值记录帮助函数

  #+name: max-helper-function
  #+begin_src lisp
    ;;; 最大值记录帮助函数
    (let ((max-value   0)
          (max-pattern NIL))
      (defun max-reset (&optional (max 0))
        "重置 MAX-VALUE 的值为 MAX, 默认为 0."
        (setf max-value   max
              max-pattern NIL))

      (defun re-max (&optional pattern)
        "比较 PATTERN 长度和 MAX-VALUE 的大小并更新 MAX-VALUE 的值. 
    返回 MAX-VALUE 和 MAX-PATTERN."
        (let ((value (length pattern)))
          (when (and value (> value max-value))
            (setf max-value value
                  max-pattern pattern)))
        (values max-value max-pattern)))
  #+end_src

#+begin_html
</details>
#+end_html

#+name: max-connection-matrix
#+begin_src lisp
  (defun max-connection-matrix (matrix)
    "在邻接矩阵的基础上查找最大的两两连接图."
    (labels ((test-connection (node others)
               "判断 NODE 与 OTHERS 之间是否相连."
               (loop for other in others
                     if (not (eq 1 (at matrix node other)))
                       do (return NIL)
                     finally (return T)))
             (search-max (to-search searched-nodes)
               "查找最大两两连接图的递归函数."
               (if (null to-search)
                   (re-max searched-nodes)
                   (let ((node  (first to-search)))
                     (search-max (rest to-search)
                                 (if (test-connection node searched-nodes)
                                     (cons node searched-nodes)
                                     searched-nodes))))))

      (max-reset)                         ; 重置最大值
      (let* ((size  (length matrix))
             (nodes (loop for idx below size collect idx)))
        (loop for start in nodes do       ; 选择不同的起点
              (search-max nodes (list start))))
      (re-max)))
#+end_src

#+begin_html
<details><summary> 一些掉书袋的东西 </summary>
#+end_html

其实也不是掉书袋, 分析一下算法的复杂度而已: 对于一个 \(M_{n \times n}\) 的方阵,
分析的时候将其节点序号编号为 \(1, 2, \dots, i, \dots, n\),
当取 =node= 为第 \(i\) 号节点时, =searched-nodes= 的大小 \(\leq i\),
那么计算中的消耗:
+ =test-connection= 最多需要比较 =(length searched-nodes)= 次,
  于是可以近似为 \(O(i)\) 次.
+ 一次 =search-max= 需要计算第 \(1, \dots, n\) 个 =node=,
  那么对应需要 \(\sum i = \frac{n(n + 1)}{2}\) 次计算, 近似为 \(O(n^2)\) 次.
+ 而需要从 \(n\) 个起点开始, 所以复杂度为 \(O(n^3)\).

(注: 我也不是啥正经计算机系人, 大概就是这样的一个复杂度?
算错了我也可以负责一下, 不过没人来扣我分就是了.)

#+begin_html
</details>
#+end_html

不过在看结果的时候, 突然想到如果有这样的一个图:
其中的节点到任意节点 (包括自身) 都存在边, 那么这个时候,
是不是就不存在可以分解为堆的情况呢?

但是, 理论上应该是不可能的, 在环 \(\mathbb{Z}_p\) 上, 总是存在逆元.
所以 \(x\) 的逆元和 \(x\) 之间一定不存在边. 于是在上面的问题里面,
既然已经得到了最大两两相连图的节点组 \(X\), 那么任意取 \(x \in X\),
往其中添加一个 \(x^{-1}\) 形成的新的组 \(X' = X \cup \{x^{-1}\}\) 就是最小的满足条件的组了.

于是对于不同的 \(p\), 就应该也许大概可以计算咯:

#+begin_src lisp
  (defun test (p)
    "简单的测试函数, 测试对于整除 P 的组合的可能的结果数量."
    (let* ((patterns     (z-mod-m-ring-patterns p))
           (odd-patterns (pick-out-patterns p patterns))
           (matrix       (arc-to-matrix (expt p 3) odd-patterns)))
      (multiple-value-bind (size pattern-idx)
          (max-connection-matrix matrix)
        (values size
                pattern-idx
                patterns))))
#+end_src

#+begin_html
<details><summary> 更加详细的一些测试 </summary>
#+end_html

那么一个想法就是测试上面 =test= 函数得到的结果是否满足一开始的要求:
+ 两两之间总会有连线:

  #+begin_src lisp
    (defun test-connection (nodes matrix)
      "测试 NODES 在 MATRIX 中是否是两两相连的. 
    返回 T 如果是两两相连的, 否则返回 NIL.

    示例代码:
        (let* ((p 3)
               (patterns     (z-mod-m-ring-patterns p))
               (odd-patterns (pick-out-patterns p patterns))
               (matrix       (arc-to-matrix (expt p 3) odd-patterns)))
          (multiple-value-bind (- pattern-idx)
              (max-connection-matrix matrix)
            (test-connection pattern-idx matrix)))
    返回的结果应当为 T."
      (let ((upper (length nodes)))
        (loop for i below upper
              if (loop for j from (1+ i) below upper
                       if (eq 0 (at matrix (nth i nodes) (nth j nodes)))
                         do (return T)
                       finally (return NIL))
                do (return NIL)
              finally (return T))))
  #+end_src
+ 确认没有其他的节点 (最大): 添加任意一个新节点, 则不满足两两相连的条件.

  #+begin_src lisp
    (defun test-max-connection (nodes matrix)
      "测试是否为最大的连接.

    示例代码:
         (let* ((p 3)
               (patterns     (z-mod-m-ring-patterns p))
               (odd-patterns (pick-out-patterns p patterns))
               (matrix       (arc-to-matrix (expt p 3) odd-patterns)))
          (multiple-value-bind (- pattern-idx)
              (max-connection-matrix matrix)
            (test-max-connection pattern-idx matrix)))
    结果应当为 T."
      (loop for idx below (length matrix)
            if (and (not (find idx nodes))
                    (test-connection (cons idx nodes) matrix))
              do (return NIL)
            finally (return T)))
  #+end_src

#+begin_html
</details>
#+end_html

那么对于 p = 3 的情况, 应该得到的结论为:

#+name: test-p-3
#+headers: :tangle no :results replace
#+begin_src lisp :exports both
  (test 3)
#+end_src

#+RESULTS: test-p-3
: 15

